In [1]:
import pandas as pd

#Series

In [6]:
import numpy as np

In [10]:
labels  = ['a', 'b', 'c']
m = [10, 20, 30]
arr = np.array(m)
d = {'a' : 10, 'b' : 20, 'c' : 30}

In [14]:
pd.Series(data = m)

0    10
1    20
2    30
dtype: int64

In [26]:
p = pd.Series(data = d)

In [28]:
p + p

a    20
b    40
c    60
dtype: int64

Data frames

In [31]:
from numpy.random import randn

In [35]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  0.725127  0.030573 -0.799398  0.677620
B  0.126180 -0.162855  0.169015 -0.117942
C -0.162986 -0.168372  0.431808  2.239725
D  0.625566  0.869172  0.516938  0.186385
E  1.479880 -1.344316 -0.524013 -0.495055

In [37]:
df['W']

A    0.725127
B    0.126180
C   -0.162986
D    0.625566
E    1.479880
Name: W, dtype: float64

In [39]:
type(df['W'])

pandas.core.series.Series

In [47]:
df[['W', 'X']]

          W         X
A  0.725127  0.030573
B  0.126180 -0.162855
C -0.162986 -0.168372
D  0.625566  0.869172
E  1.479880 -1.344316

In [49]:
df['new'] = df['X'] + df['W']
df

          W         X         Y         Z       new
A  0.725127  0.030573 -0.799398  0.677620  0.755700
B  0.126180 -0.162855  0.169015 -0.117942 -0.036675
C -0.162986 -0.168372  0.431808  2.239725 -0.331358
D  0.625566  0.869172  0.516938  0.186385  1.494737
E  1.479880 -1.344316 -0.524013 -0.495055  0.135565

In [51]:
booldf = df > 0
booldf

       W      X      Y      Z    new
A   True   True  False   True   True
B   True  False   True  False  False
C  False  False   True   True  False
D   True   True   True   True   True
E   True  False  False  False   True

In [55]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

Missing Data

In [58]:
d = {'A' : [1,2,np.nan], 'B':[5,np.nan, np.nan], 'C':[1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [60]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [62]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

GroupBy